#有一个列表，[“北京”,”上海”,”广东”]
#1)	将中国所有省会城市添加到上述列表中
'''
list=["北京","上海","广东"]
list1=["天津","重庆","哈尔滨","长春","沈阳","呼和浩特",
        "石家庄","乌鲁木齐","兰州","西宁","西安","银川",
        "郑州","济南","太原","合肥","长沙","武汉","南京",
        "成都","贵阳","昆明","南宁","拉萨","杭州","南昌",
        "广州","福州","台北","海口"]
i=0
while i<30:
    list.append(list1[i])
    i+=1

print(list)
#2)	广东成为第二大发达城市，将广东排在上海前面
list[1],list[2]=list[2],list[1]
print(list)

#3)	[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
#这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
list3=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
i=0
sum=0
while i<=7:
    print(list3[i])
    sum += list3[i]
    i+=1
print("JDP和为",sum)

'''
#有以下一个列表，求其中是5的倍数的和
'''
a = [1,5,21,30,15,9,30,24]
sum=0
for i in a:
    print("列表的数为",i)
    if i%5==0:
        sum+=i
        print("能整除5的和为：",sum)
    else:
       pass
'''

'''
#有下列列表，请编程实现列表的数据翻转（京东金融的测试开发笔试题）
#List = [1,2,3,4,5,6,7,8,9]
#实现效果：list = [9,8,7,6,5,4,3,2,1]
list=[1,2,3,4,5,6,7,8,9]
for i in reversed(list):
    print("实现结果为",list)
    break

'''
#请编程统计列表中的每个数字出现的次数(百度初级测试开发笔试题)
#List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
list=[1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
list1={}
for i in list:
    if i not in list1:
        list1[i]=1
    else:
        list1[i]+=1
print(list1)

















